0.57.2119-1/DataProcessors/ККСНГ_СинхронизацияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ККСНГ_СинхронизацияКонтрагентов</Name>
			<Comment>Синхронизация контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрофильЭДООрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КраткоеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодУчастникаЭДО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>47</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентЭДО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

0.57.2119-1/DataProcessors/ККСНГ_СинхронизацияКонтрагентов/Forms/ОтправкаПриглашений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ПрофильОрганизацииЭДО = Параметры.ПрофильОрганизацииЭДО;
	ЗаполнитьПолучателейПриглашений();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаКомандыОтправки.Видимость = Истина;
	Элементы.ГруппаИтогиОтправки.Видимость = Ложь;
	
	ОбновитьКоличествоПриглашений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 Закрыть(Новый Структура("ОбновитьСписокПриглашений", Истина));
 КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучателиПриглашений

&НаКлиенте
Процедура ПолучателиПриглашенийОтправлятьПометкаПриИзменении(Элемент)
	ОбновитьКоличествоПриглашений();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Пригласить(Команда)
	ОтправитьВыбранныеПриглашения();	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Новый Структура("ОткрытьВыборКонтрагентов", Истина));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОтображениеДанных

&НаСервере
Процедура ЗаполнитьПолучателейПриглашений()
	
	Если ТипЗнч(Параметры.Контрагенты1С) = Тип("Массив") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Контрагент,
			|	Контрагенты.ИНН КАК ИНН,
			|	Контрагенты.КПП КАК КПП,
			|	Контрагенты.Представление КАК Представление
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка В(&Контрагенты1С)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ИНН УБЫВ,
			|	КПП УБЫВ";
		Запрос.УстановитьПараметр("Контрагенты1С", Параметры.Контрагенты1С);

		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПолучательСтрока = ПолучателиПриглашений.Добавить();
				ЗаполнитьЗначенияСвойств(ПолучательСтрока, Выборка);
				ПроверенИНН = ПроверенИНН(Выборка.ИНН);
				ПолучательСтрока.ОтправлятьПометка = ПроверенИНН;
				ПолучательСтрока.Проверен = ПроверенИНН;				
				ПолучательСтрока.Статус = ?(Не ПроверенИНН, "Некорректный ИНН контрагента", "");				
			КонецЦикла; 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПроверенИНН(ПроверяемыйИНН)
	
	ПроверенИНН = Ложь;	
	Если ЗначениеЗаполнено(ПроверяемыйИНН) Тогда
		ПроверенИНН = ККСНГ_РаботаСКонтрагентамиВызовСервера.КорректныйИНН(ПроверяемыйИНН);	
	КонецЕсли;
	
	Возврат ПроверенИНН;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКоличествоПриглашений()
	КоличествоПолучателей = ПолучателиПриглашений.НайтиСтроки(Новый Структура("ОтправлятьПометка", Истина)).Количество();
	Элементы.Пригласить.Заголовок = СтрШаблон("Пригласить (%1)", КоличествоПолучателей);	
	Элементы.Пригласить.Доступность = НЕ КоличествоПолучателей = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыОтправкиПриглашений(СтатусыОтправкиПриглашений)
	
	Для каждого СтатусОтправкиПриглашения Из СтатусыОтправкиПриглашений Цикл
		
		СтруктураОтбора = Новый Структура("Контрагент, ОтправлятьПометка", СтатусОтправкиПриглашения.Контрагент, Истина);
		ВыбранныеПолучателиПриглашений = ПолучателиПриглашений.НайтиСтроки(СтруктураОтбора);
		Для каждого ВыбранныеПолучателиПриглашенийСтрока Из ВыбранныеПолучателиПриглашений Цикл
			ВыбранныеПолучателиПриглашенийСтрока.Статус = СтатусОтправкиПриглашения.КодСтатуса;		
		КонецЦикла;
		
	КонецЦикла;
	
	НастроитьПредставлениеСпискаВыбораПоляФормы(Элементы.ПолучателиПриглашенийСтатус.Имя);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПредставлениеСпискаВыбораПоляФормы(Знач ПолеФормыИмя)
	
	ПолеФормыВыбора = Элементы[ПолеФормыИмя];
	
	Для каждого ЭлементВыбора Из ПолеФормыВыбора.СписокВыбора Цикл
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

        ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементВыбора.Представление);

        // Условие
        ЭлементУсловия  = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеФормыВыбора.ПутьКДанным);
        ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
        ЭлементУсловия.ПравоеЗначение = ЭлементВыбора.Значение;

        // Поле
        ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
        ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеФормыВыбора.Имя);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПриглашениями

&НаКлиенте
Процедура ОтправитьВыбранныеПриглашения()
	
	ВыбранныеКонтрагенты1С = ККСНГ_ПриглашенияВызовСервера.ПолучитьВыбранныхКонтрагентов1С(ПолучателиПриглашений);
	ПослеАвторизации = Новый ОписаниеОповещения("ПригласитьКонтрагентовЗавершение", ЭтотОбъект, ВыбранныеКонтрагенты1С);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильОрганизацииЭДО, ПослеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПригласитьКонтрагентовЗавершение(ЗапросПараметрыАвторизации, ВыбранныеКонтрагенты1С) Экспорт

	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		РезультатПроверки = ККСНГ_ПриглашенияВызовСервера.КонтрагентыЗарегистрированыВКурьере(ПараметрыАвторизации, ВыбранныеКонтрагенты1С);
		Если НЕ РезультатПроверки.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(РезультатПроверки.Журнал);
			Возврат;	
		КонецЕсли;
		
		ЗарегистрированныеКонтрагентыЭДО = РезультатПроверки.Результат.ЗарегистрированныеКонтрагентыЭДО;
		
		ОтправкаПриглашений = ККСНГ_ПриглашенияВызовСервера.ПригласитьКонтрагентов(	ВыбранныеКонтрагенты1С, 
																					ЗарегистрированныеКонтрагентыЭДО, 
																					ПрофильОрганизацииЭДО, 
																					ПараметрыАвторизации);
		
		ИтогиОтправлено = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтправкаПриглашений.Результат, "КоличествоОтправленных", -1);
		ИтогиОшибокОтправки = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтправкаПриглашений.Результат, "КоличествоНеОтправленных", -1);
		ИтогиОтсутствуетВСервисеЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтправкаПриглашений.Результат, "КоличествоНеЗарегистрированных", -1);
		
		СтатусыОтправкиПриглашений = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтправкаПриглашений.Результат, "Статусы", Новый Массив);
		ОбновитьСтатусыОтправкиПриглашений(СтатусыОтправкиПриглашений);
															
		Элементы.ГруппаКомандыОтправки.Видимость = Ложь;
		Элементы.ГруппаИтогиОтправки.Видимость = Истина;
		Элементы.ПолучателиПриглашенийОтправлятьПометка.ТолькоПросмотр = Истина;
		Элементы.Закрыть.КнопкаПоУмолчанию = Истина;
		
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
